In [45]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']}, index=[0,1,2,3])
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [9]:
## Finding unique values in dataframe
(df['col2'].unique())

array([444, 555, 666])

In [5]:
df['col2'].nunique() ## count of unique values

3

In [10]:
## frequency of unique values
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [12]:
## SELECTING DATA

In [14]:
df[df['col1'] > 2]  ## conditional

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [16]:
df[(df['col1'] >2) & (df['col1'] < 4 )]  ## combining conditions

   col1  col2 col3
2     3   666  ghi

In [17]:
## apply function (very powerful) allows us to pass custom functions
def times3(x):
    return x * 3

In [18]:
df["col1"].sum() ## but what if we want to add a custom function instead of the sum, so use apply and pass your function.

10

In [20]:
df["col1"].apply(times3) ## see it works

0     3
1     6
2     9
3    12
Name: col1, dtype: int64

In [24]:
## PASSING BUILT IN FUNCTIONS TOO INSIDE apply method
df["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [26]:
## works better with lambda function. Its clean to write
df["col2"].apply(lambda x: x * 100)

0    44400
1    55500
2    66600
3    44400
Name: col2, dtype: int64

In [27]:
## remove the col
df.drop("col1", axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [28]:
## Info about columns
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [31]:
## info about rows / index in pandas
df.index

Index([0, 1, 2, 3], dtype='int64')

In [36]:
## sorting column values so eventually its the rows whose order will get changed.
df.sort_values(by="col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [38]:
## finding null values
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

#### PIVOT TABLES- A pivot table is a tool that helps you summarize, group, and analyze large amounts of data quickly. Think of it as a smart table that reorganizes data into an easy-to-read format.

In [40]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [42]:
## Pivot table here
df.pivot_table(values="D", index=["A", "B"], columns=["C"])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN